Planning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Green Engine Planning Document</title>
<!-- 2018-06-24 Sun 13:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ethan Breit" />
</head>
<body>
<div id="content">
<h1 class="title">Green Engine Planning Document</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Quick Explanation</a></li>
<li><a href="#sec-2">2. VERSION 2.2: (Design goals revised)</a>
<ul>
<li><a href="#sec-2-1">2.1. Major Changes:</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Gradually Drop support for OpenGL 4.5 and below.</a></li>
<li><a href="#sec-2-1-2">2.1.2. All shaders should be compiled to SPIR-V</a></li>
<li><a href="#sec-2-1-3">2.1.3. Revised ECS.</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Shaders and Materials</a></li>
</ul>
</li>
<li><a href="#sec-3">3. VERSION 2.0:</a>
<ul>
<li><a href="#sec-3-1">3.1. Shaders and Materials</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Requirements and possible solutions</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. Loading</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Quick Explanation</h2>
<div class="outline-text-2" id="text-1">
<p>
The template for the Green Engine Planning Document is as follows. The first bullet is the general topic, the second bullet is the more specific sub-topic, the numbered bullets are answers.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> VERSION 2.2: (Design goals revised)</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Major Changes:</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Gradually Drop support for OpenGL 4.5 and below.</h4>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> All shaders should be compiled to SPIR-V</h4>
</div>
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Revised ECS.</h4>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Shaders and Materials</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Manifests
<ul class="org-ul">
<li>Uniforms
<ul class="org-ul">
<li>Manifests will now contain layout info of uniforms. This is done for Opengl 3.* compatability, this means we can now standardize uniform access across APIs (by name). The uniform info will be stored as a name and layout location.
</li>
</ul>
</li>
</ul>
</li>
<li>Building.
<ul class="org-ul">
<li>There should be a shader compilation stage to the build. This will convert all shaders into SPIR-V and generate manifest data for each shader.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> VERSION 2.0:</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Shaders and Materials</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Requirements and possible solutions</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Not restricting to user.
<ul class="org-ul">
<li>Don't make it required to use the Green Engine's Shader Utilities and pre built Shaders.
</li>
</ul>
</li>

<li>Support multiple rendering styles.
<ul class="org-ul">
<li>Physically based rendering (PBR).
</li>
<li>Phong (should be discouraged).
</li>
<li>Blinn Phong.
</li>
</ul>
</li>

<li>Flexable
<ul class="org-ul">
<li>Preferably a Dynamic amount of lights (might not be possible).
</li>
<li>Global configuration file for shaders.
</li>
</ul>
</li>

<li>Pre-Processor
<ul class="org-ul">
<li>include or equivelant
<ol class="org-ol">
<li><code>( #pragma include " /PATH/ " )</code> Would include another text document/shader into shader being built. Path should be relative to current file.
</li>
<li><code>( #pragma include &lt; /PATH/ &gt; )</code> Would include another text document/shader into shader being built. Path should be relative to Head of resources directory.
</li>
</ol>
</li>
</ul>
</li>

<li>Shaders
<ul class="org-ul">
<li>Compatible with all APIS
<ol class="org-ol">
<li><b>SPIR-V</b>, <b>SPIR-V Cross</b>, and Shader Manifests
<ul class="org-ul">
<li>If all shaders where built into <b>SPIR-V</b> bytecode then <b>Vulkan</b> and newer versions of <b>OpenGL</b> (via KHR extension) can use the same shaders.
</li>
<li>For older versions of <b>OpenGL</b> and <b>Metal</b>, <b>SPIR-V</b> Cross can be used in combination with automatically built shader manifest files
</li>
</ul>
</li>

<li>Some Higher level shader language
</li>
</ol>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Loading</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Need to create empty template clases to load data into so no OpenGL calls are made. OpenGL calls have to be on the OpenGL Thread (Rendering Thread) making asynchronouse loading impossible and also making loading freeze the entire game.
</p>

<p>
To add onto the previous statement we could aslo remove the data from the real vertex buffer class and have a pointer to the empty template class to retrieve the data. This would essentially make the real vertex buffer just a pointer with some functions.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ethan Breit</p>
<p class="date">Created: 2018-06-24 Sun 13:12</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
